Repository: sizhit316/twint
Catalog: localization/mametwint-*_informal.po
Languages: de

source: Renew the certificate?
de: Sicherheits-Zertifikat erneuern?

source: If you have multiple shops connected to the same TWINT account please remember to copy the twint.pem file from the folder <strong>wp-content/uploads/mame_twint</strong> to all other installations after the certificate renewal.
de: Wenn mehrere Shops mit demselben TWINT-Konto verknüpft sind muss nach der Zertifikat-Erneuerung die Datei twint.pem im Ordner <strong>wp-content/uploads/mame_twint</strong> zu allen anderen WordPress-Installationen kopiert werden.

source: The license activation failed. Please check the logs.
de: Aktivierung der Lizenz fehlgeschlagen. Bitte prüfe die Logs.

source: The license deactivation failed. Please check the logs.
de: Deaktivierung der Lizenz fehlgeschlagen. Bitte prüfe die Logs.

source: The license check failed. Please check the logs.
de: Überprüfung der Lizenz fehlgeschlagen. Bitte prüfe die Logs.

source: Are you sure you want to cancel the setup? You can always restart the setup by clicking 'Start setup assistant ' in the settings.
de: Bist du sicher, dass die Einrichtung abgebrochen werden soll? Du kannst den Einrichtungsassistent jederzeit neu starten, indem du bei den Einstellungen auf „Einrichtungsassistent starten“ klickst.

source: Are you sure you want to confirm the transaction?
de: Bist du sicher, dass die Transaktion bestätigt werden soll?

source: Are you sure you want to cancel the transaction?
de: Bist du sicher, dass die Transaktion storniert werden soll?

source: Every %1$s hours
de: Einmal pro %1$s Stunde(n)

source: Order check: every %1$s minutes
de: TWINT Bestellstatus Check: alle %1$s Minuten

source: Once weekly
de: Einmal wöchentlich

source: Settings
de: Einstellungen

source: Documentation
de: Anleitung

source: The SOAP extension is not enabled on your server. The payment method TWINT will not work if SOAP is not enabled.
de: Die SOAP-Erweiterung ist nicht aktiviert auf dem Server. Die Zahlungsart TWINT kann nur verwendet werden, wenn SOAP aktiviert ist.

source: Successfully settled transaction.
de: Transaktion wurde erfolgreich abgerechnet.

source: (Settlement)
de: (Abgerechnet)

source: Successfully cancelled transaction.
de: Transaktion wurde erfolgreich storniert.

source: (Cancellation)
de: (Stornierung)

source: TWINT credentials are missing (certificate, certificate password).
de: TWINT Verbindungsparameter fehlen (Zertifikat, Zertifikat-Passwort).

source: SoapClient not active on the server.
de: SoapClient ist nicht aktiviert auf dem Server.

source: Certificate expires %1$s
de: Das Zertifikat verfällt am %1$s

source: Please provide a Store UUID.
de: Bitte gib eine Store UUID an.

source: Wrong Store UUID format. UUID must be of the form xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx
de: Falsches Store UUID-Format. Die UUID muss die Form xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx aufweisen

source: Please provide a certificate password.
de: Bitte gib ein Zertifikatpasswort ein.

source: Please provide a cash register ID.
de: Bitte gib eine Kassen-ID ein.

source: Successfully saved credentials.
de: Parameter wurden erfolgreich gespeichert.

source: No file found
de: Keine Datei gefunden

source: Please enter and save password first before uploading the certificate
de: Bitte gib zuerst das Passwort ein und speichere die Einstellungen, bevor du das Zertifikat hochlädst

source: Failed to read file.
de: Datei konnte nicht gelesen werden.

source: Filetype not supported. Please upload a p12 or txt file.
de: Dateiformat wird nicht unterstützt. Bitte lade eine p12- oder txt-Datei hoch.

source: File successfully converted.
de: Datei erfolgreich konvertiert.

source: The openssl extension is not active on your server. Either activate it or upload the converted certificate in txt format.
de: Die Erweiterung openssl ist nicht auf dem Server aktiviert. Aktiviere openssl oder lade das konvertierte Zertifikat im txt-Format hoch.

source: Failed to parse certificate file. Please make sure that the password is correct. Provided password: %1$s
de: Zertifikat-Datei konnte nicht geparst werden. Bitte überprüfe das Passwort. Gespeichertes Passwort: %1$s

source: Unable to extract private key.
de: Der Private Key konnte nicht erstellt werden.

source: Unable to extract export certificate
de: Das Export-Zertifikat konnte nicht erstellt werden

source: Failed to create file
de: Erstellen der Datei fehlgeschlagen

source: File saved.
de: Datei gespeichert.

source: Error. Please check the logs.
de: Fehler. Bitte prüfe die Logs.

source: Order UUID missing
de: Order UUID fehlt

source: Status: %1$s. Reason: %2$s.
de: Status: %1$s. Begründung: %2$s.

source: Renewal not allowed yet. Renewals are not allowed earlier than 60 days before expiration.
de: Erneuerung noch nicht erlaubt. Erneuerungen können frühestens 60 Tage vor Ablauf vorgenommen werden.

source: Please update the database of the TWINT plugin.
de: Bitte update die Datenbank für das TWINT-Plugin.

source: Update now
de: Jetzt updaten

source: The TWINT database update is in progress. The update is complete when this message disappears
de: Das TWINT Datenbank-Update wird durchgeführt. Das Update ist beendet wenn diese Nachricht verschwindet

source: Database update successful.
de: Datenbank-Update erfolgreich.

source: TWINT Order Status
de: TWINT Bestellungsstatus

source: Order status
de: Bestellungsstatus

source: Status reason
de: Status-Begründung

source: Completed transactions
de: Fertiggestellte Transaktionen

source: Type
de: Art

source: Amount
de: Betrag

source: Fee
de: Gebühr

source: Check payment status
de: Zahlungsstatus prüfen

source: Settle transaction
de: Transaktion abrechnen

source: Cancel transaction
de: Transaktion stornieren

source: Start setup assistant
de: Einrichtungsassistent starten

source: General
de: Allgemein

source: Upload the certificate you downloaded from your TWINT account in p12 format to automatically convert it. Please first enter the certificate password and save it before uploading the certificate. If automatic conversion fails you will have to manually convert the certificate to PEM format and either rename it twint.txt and use the upload button or directly upload the renamed file twint.pem to the directory wp-content/uploads/mame_twint. Read the <a href="https://documentation.mame-webdesign.ch/?p=273&lang=en#1-2%c2%a0certificate-creation" target="_blank">documentation</a> for more information.
de: Lade das Zertifikat, welches du von deinem TWINT-Konto heruntergeladen hast, im p12-Format hoch um es automatisch ins PEM-Format zu konvertieren. Bitte gib zuerst das Zertifikat-Passwort ein und speichere die Einstellungen bevor du das Zertifikat hochlädst. Falls die automatische Konvertierung fehlschlägt, muss das Zertifikat manuell ins PEM-Format umgewandelt und danach entweder in twint.txt umbenannt und über den Upload-Button hochgeladen oder in twint.pem umbenannt und ins Verzeichnis wp-content/uploads/mame_twint hochgeladen werden. Bitte lies die <a href="https://documentation.mame-webdesign.ch/?p=250#1-2-zertifikat-erstellen" target="_blank">Anleitung</a> für weitere Informationen.

source: <br><span class="mame-warning">The PHP extension openssl seems not to be active on your server which means that automatic conversion will not work.</span>
de: <br><span class=„mame-warning“>Die PHP-Erweiterung openssl scheint nicht aktiviert zu sein auf deinem Server. Das Zertifikat kann daher nicht automatisch umgewandelt werden.</span>

source: TWINT General Settings
de: TWINT allgemeine Einstellungen

source: Please read the <a href="
de: Bitte lies die <a href="

source: " target="_blank">documentation</a> for the configuration of the settings.
de: " target="_blank">Anleitung</a> für die Konfiguration der Einstellungen.

source: License key
de: Lizenzschlüssel

source: Enter your license code to receive updates and support for the TWINT plugin.
de: Gib unten Deinen Lizenzcode ein, um "TWINT for WooCommerce" zu aktivieren und Updates und Support zu erhalten.

source: The UUID of your store can be found in the TWINT account by selecting your shop on the page <strong>STORES > [edit store button]</strong>. If the list of stores is empty you will first have to create a store.
de: Die UUID deines Shop kann im TWINT-Konto gefunden werden auf der Seite <strong>STORES > [Store-Bearbeiten-Button]</strong>. Wenn die Liste der Shops leer ist muss zuerst ein Shop hinzugefügt werden.

source: Certificate passphrase
de: Zertifikat Passwort

source: The password for the certificate which was set in the TWINT account when the certificate was created. This is not the password for the TWINT account. Please only use the following special characters in your password: ~!@#%^*_+-={}[]:,./
de: Das Zertifikat-Passwort welches im TWINT festgelegt wurde, als das Zertifikat erstellt wurde. Dies ist nicht das Password für das TWINT-Konto. Bitte verwende nur die folgenden Sonderzeichen im Passwort: ~!@#%^*_+-={}[]:,./

source: Cash Register ID
de: Kassen-ID

source: Choose any ID to identify transactions from your sales point in the TWINT backend. You can choose any name but names have to be different for shops which use the same TWINT account.
de: Wähle eine beliebige ID um Transaktionen vom deinem Shop im TWINT-Konto identifizieren zu können. Wenn dasselbe TWINT-Konto für mehrere Shops verwendet wird, müssen sich die IDs unterscheiden.

source: Certificate
de: Sicherheits-Zertifikat

source: Enroll cash register
de: Kasse anmelden

source: Before you can use TWINT you will have to enroll your cash register once. Do this after you have filled in the settings above and converted the certificate.
de: Um TWINT verwenden zu können, muss die Kasse einmal registriert werden. Fülle dazu zuerst die Felder oben aus und lade das Zertifikat hoch.

source: Payment type
de: Zahlungs-Typ

source: Select 'immediate' to confirm the transaction immediately when the customer completes the payment (default). If 'deferred' is selected, the amount is only reserved and you will need to manually confirm the transaction from the order edit screen. Deferred payments have to be confirmed whith 30 days.
de: Wähle „sofort“ um Transaktionen direkt zu bestätigen wenn der Kunde die Zahlung abschliesst (Standard). Wenn „verzögert“ ausgewählt ist, wird der Betrag einer Transaktion nur reserviert und die Transaktion muss manuell vom Bestellung-Bearbeitungsbildschirm bestätigt werden. Verzögerte Zahlungen müssen innerhalb von 30 Tagen bestätigt werden.

source: Immediate
de: Sofort

source: Deferred
de: Verzögert

source: Only enable for CHF
de: Nur für CHF aktivieren

source: TWINT payments are only possible in Swiss Francs (CHF). If this option is selected the TWINT payment gateway will only be shown on the checkout page for payments in CHF.
de: TWINT nimmt nur Zahlungen in Schweizer Franken (CHF). Wenn diese Checkbox aktiviert ist, wird die Zahlungsart TWINT nur an der Kasse angezeigt für Zahlungen in CHF.

source: Add customer data to reference number sent to TWINT. This will make it easier to search for certain transactions in the TWINT backend.
de: Kundendaten zur Referenznummer hinzufügen, die an TWINT gesendet wird. Dies vereinfacht die Suche nach bestimmten Transaktionen im TWINT-Konto.

source: Billing first name
de: Rechnung: Vorname

source: Billing last name
de: Rechnung: Nachname

source: Billing company
de: Rechnung: Firma

source: Shipping first name
de: Versand: Vorname

source: Shipping last name
de: Versand: Nachname

source: Shipping company
de: Versand: Firma

source: System check email address
de: E-Mail-Adresse für Systemcheck

source: Enter the email address to which system emails should be sent (e.g. when the TWINT system check or the certificate renewal fails.
de: Gib die E-Mail-Adresse ein, an die System-E-Mails gesendet werden sollen (z.B. wenn der System-Check oder die Zertifikat-Erneuerung fehlschlägt).

source: Advanced settings
de: Erweiterte Optionen

source: These settings are optional.
de: Diese Einstellungen sind optional.

source: Automatically renew certificate
de: Automatisch Zertifikat erneuern

source: The TWINT certificate can be renewed automatically before it expires. Please note that this will not work if you have multiple shops connected to the same TWINT account. In this case you will need to manually renew the certificate in the TWINT portal and then upload it to each shop.
de: Das TWINT-Zertifikat kann automatisch erneuert werden bevor es verfällt. Bitte beachte, dass dies nicht möglich ist wenn mehrere Shops mit demselben TWINT-Konto verbunden sind. In diesem Fall muss das Zertifikat manuell erneuert und dann in jedem Shop hochgeladen werden.

source: Renew certificate
de: Zertifikat erneuern

source: Here you can manually renew the certificate. Please note that if you are using multiple shops with the same TWINT account you will need to manually copy the created PEM certificate file from this shop to the other shops. The file can be found in the folder "wp-content/uploads/mame_twint". Alternatively you can renew the certificate from the TWINT backend and then upload it to all shops via the upload button above.
de: Hier kann das Zertifikat manuell erneuert werden. Bitte beachte, dass die erstellte PEM-Datei von diesem Shop zu den anderen Shops kopiert werden muss, falls mehrere Shops mit demselben TWINT-Konto verknüpft sind. Die Datei kann im Ordner „wp-content/uploads/mame_twint“ gefunden werden. Alternativ kann das Zertifikat vom TWINT-Backend aus erneuert und dann via Upload-Button oben in allen Shops hochgeladen werden.

source: Enter the timeout for the payment process in seconds or leave empty for default/maximum value 180.
de: Gib ein Timeout für den Zahlungsprozess in Sekunden an oder leer lassen für Standard-/Maximalwert 180.

source: SOAP request interval
de: SOAP-Request Intervall

source: The interval between SOAP calls in seconds. Leave empty for default value 2.
de: Das Intervall in Sekunden zwischen SOAP-Anfragen zum TWINT-Servier. Leer lassen für Standardwert 2.

source: SOAP connection timeout
de: SOAP-Verbindung Timeout

source: The connection timeout for SOAP calls. Should be lower than the maximum execution time of the server.
de: Das Verbindungs-Timeout für SOAP-Calls. Sollte tiefer als die Maximum Execution Time des Servers sein.

source: Order status cron job interval
de: Bestellstatus Cron Job Intervall

source: Enter how often the cron job should run (in minutes) to check and update orders paid by TWINT which were successfully paid but where the order status was not updated correctly. Enter 0 to deactivate the cron action.
de: Wie oft (in Minuten) soll ein Cron-Job laufen um Bestellungen zu überprüfen, welche erfolgreich mit TWINT bezahlt wurden, jedoch nicht korrekt aktualisiert wurden. 0 eingeben um die Cron-Aktion zu deaktivieren.

source: System check interval
de: System-Check Intervall

source: The plugin periodically performs a system check to check if the TWINT service is available and sends an email to the email address in the <strong>System check email address</strong> field if the system check fails. Enter the number of hours to define the interval of the system check.
de: Das Plugin nimmt regelmässig einen System-Check vor um zu prüfen ob TWINT verfügbar ist. Falls das System nicht erreichbar ist, wird eine E-Mail an die im Feld <strong>System-Check E-Mail-Adresse</strong> eingetragene E-Mail-Adresse versendet. Gib die Anzahl Stunden ein nach denen jeweils ein System-Check ausgeführt werden soll.

source: Order status after successful payments for orders with non-virtual products
de: Bestellstatus für nicht-virtuelle Produkte nach einer erfolgreichen Zahlung

source: Select the order status to be applied on successful payment for orders containing non-virtual products.
de: Wähle den Bestellstatus nach einer erfolgreichen Zahlung für Bestellungen die nicht-virtuelle Produkte enthalten.

source: on-hold
de: In Wartestellung

source: processing
de: In Bearbeitung

source: completed
de: Abgeschlossen

source: Order status after successful payments for virtual products
de: Bestellstatus für virtuelle Produkte nach einer erfolgreichen Zahlung

source: Select the order status to be applied on successful payment for orders containing only virtual products.
de: Wähle den Bestellstatus nach einer erfolgreichen Zahlung für Bestellungen die ausschliesslich virtuelle Produkte enthalten.

source: Order status for deferred payments.
de: Bestellstatus für verzögerte Zahlungen.

source: Select the WooCommerce order status for deferred payments which are not settled yet. Only applies if 'deferred' is selected under 'Payment type'.
de: Wähle den WooCommerce-Bestellstatus für verzögerte Zahlungen, die noch nicht abgerechnet wurden. Wird nur berücksichtigt wenn unter „Zahlungs-Typ“ der Wert „verzögert“ ausgewählt ist.

source: On-hold
de: In Wartestellung

source: Processing
de: In Bearbeitung

source: Completed
de: Abgeschlossen

source: Write logs
de: Logs

source: Off
de: Aus

source: Errors
de: Fehler

source: All events
de: Alle Ereignisse

source: Select the log level.
de: Wähle den Log-Level.

source: Delete logs after
de: Logs löschen nach

source: Enter the number of days after which logs will automatically be deleted. If left empty logs will be deleted after 30 days by default.
de: Gib die Anzahl Tage ein, nach welchen Logs automatisch gelöscht werden sollen. Falls das Feld leer ist, werden Logs automatisch nach 30 Tagen gelöscht.

source: Asynchronous background task request
de: Asynchroner Request für Background Task

source: Immediately
de: Sofort

source: In shutdown action
de: In der Action shutdown

source: In AJAX request
de: Via AJAX-Request

source: In Cron action 5 minutes after starting transaction
de: In Cron Action 5 Minuten nachdem die Transaktion gestartet wurde

source: Enter the address of the proxy host if you are using a proxy. (optional)
de: Die Adresse des Proxy-Hosts, falls ein Proxy verwendet wird (optional).

source: Enter the port of your proxy if you are using a proxy. (optional)
de: Der Port des Proxys, falls ein Proxy verwendet wird (optional).

source: Force IPv4 for cURL requests
de: IPv4 für cURL-Requests erzwingen

source: Forces all cURL requests to use IPv4.
de: Erzwingt die Verwendung von IPv4 für alle cUR-Requests.

source: Tools
de: Werkzeuge

source: System info
de: Systemstatus

source: Upload file
de: Datei hochladen

source: Download log files
de: Log-Dateien herunterladen

source: License information
de: Lizenz-Information

source: TWINT information
de: TWINT-Informationen

source: Enroll
de: Registrieren

source: The (virtual) cash register has to be enrolled once before you can use TWINT on the checkout page. If you change the register ID you will have to enroll the cash register again. If enrolment fails either store UUID or certificate password is not correct or the certificate has not been correctly converted.
de: Die (virtuelle) Kasse muss registriert werden, bevor TWINT an der Kasse verwendet werden kann. Wenn du die Kassen-ID änderst, muss die Kasse erneut registriert werden. Falls die Registrierung fehlschlägt, stimmen möglicherweise Store-UUID oder Passwort nicht oder das Zertifikat wurde nicht korrekt umgewandelt.

source: Check expiry date
de: Ablaufdatum prüfen

source: Yes
de: Ja

source: No
de: Nein

source: License status
de: Lizenzstatus

source: Expiration
de: Läuft ab am

source: License limit
de: Lizenz-Limit

source: Site count
de: Anzahl Seiten

source: Activations left
de: Übrige Anzahl Aktivierungen

source: Customer email
de: Kunden E-Mail

source: Certificate expiry date
de: Zertifikat-Verfalldatum

source: No information
de: Keine Informationen

source: Cancel
de: Abbrechen

source: Confirm
de: Bestätigen

source: Payment gateway for payments with TWINT.
de: Zahlungsschnittstelle für Online-Zahlungen mit TWINT.

source: Enable TWINT payment gateway.
de: TWINT Zahlungsschnittstelle aktivieren.

source: Pay with your smartphone
de: Bezahle mit deinem Smartphone

source: Redirecting to TWINT
de: Weiterleitung zu TWINT

source: You will be redirected to the payment page of TWINT.
de: Du wirst zur Zahlungsseite von TWINT weitergeleitet.

source: Enable/disable
de: Aktivieren/deaktivieren

source: Title:
de: Titel:

source: The title of the payment method shown in the fronted.
de: Der Titel der Zahlungsart an der Kasse.

source: Description:
de: Beschreibung:

source: The description of the payment method which will be visible at the checkout page.
de: Die Beschreibung der Zahlungsart, die dem Kunden an der Kasse angezeigt wird.

source: Instructions
de: Anweisungen

source: Instructions that will be added to the thank you page and emails.
de: Diese Anweisungen werden zur Bestellbestätigungsseite hinzugefügt.

source: Payment gateway for online payments by TWINT
de: Zahlungsschnittstelle für Online-Zahlungen mit TWINT

source: TWINT is not available at the moment. Please try another payment method or contact the website administrator.
de: TWINT ist nicht verfügbar im Moment. Bitte wähle eine andere Zahlungsart oder kontaktiere den Administrator dieser Website.

source: Upload
de: Datei hochladen

source: The license for %1$s has not been activated for all sites that use the plugin.
de: Die Lizenz für %1$s wurde nicht auf allen Seiten aktiviert die das Plugin verwenden.

source: License for %1$s is invalid or missing. <a href="%2$s">ACTIVATE HERE</a>.
de: Lizenz für %1$s ist ungültig oder fehlt. <a href="%2$s">HIER</a> aktivieren.

source: Enter your license code to receive updates and support for the %1$s plugin
de: Gib unten Deinen Lizenzcode ein, um „%1$s“ zu aktivieren und Updates und Support zu erhalten

source: Activate
de: Aktivieren

source: License:
de: Lizenz:

source: Deactivate
de: Deaktivieren

source: Check license
de: Lizenz prüfen

source: You can manage your license in <a href="%1$s" target="_blank"> your account at mamedev.ch</a>.
de: Du kannst deine Lizenz in <a href="%1$s" target="_blank">deinem Konto bei mamedev.ch</a> bearbeiten.

source: Error: %1$s.
de: Fehler: %1$s.

source: Error: %1$s<br>License: %2$s<br>Expires: %3$s<br>Activations left: %4$s<br>API URL: %5$s<br>Requested domain: %6$s<br>Item name: %7$s
de: Fehler: %1$s<br>Lizenz: %2$s<br>Verfällt am: %3$s<br>Aktivierungen übrig: %4$s<br>API URL: %5$s<br>Request-Domain: %6$s<br>Produktname: %7$s

source: License activation successful.
de: Lizenz erfolgreich aktiviert.

source: Unable to activate license.
de: Lizenz konnte nicht aktiviert werden.

source: Data: %1$s
de: Daten: %1$s

source: Error: %1$s<br>License: %2$s<br>Expires: %3$s<br>API URL: %4$s<br>Requested domain: %5$s<br>Item name: %6$s
de: Fehler: %1$s<br>Lizenz: %2$s<br>Verfällt am: %3$s<br>API URL: %4$s<br>Request-Domain: %5$s<br>Produktname: %6$s

source: License deactivation successful.
de: Lizenz erfolgreich deaktiviert.

source: Unable to deactivate license.
de: Die Lizenz konnte nicht deaktiviert werden.

source: Licence invalid: %1$s<br>License: %2$s<br>Expires: %3$s<br>Activations left: %4$s<br>API URL: %5$s<br>Requested domain: %6$s<br>Item name: %7$s
de: Lizenz ungültig: %1$s<br>Lizenz: %2$s<br>Verfällt am: %3$s<br>Aktivierungen übrig: %4$s<br>API URL: %5$s<br>Request-Domain: %6$s<br>Produktname: %7$s

source: Licence valid<br>License: %1$s<br>Expires: %2$s<br>Activations left: %3$s<br>API URL: %4$s<br>Licensed domain: %5$s<br>Item name: %6$s
de: Lizenz gültig<br>Lizenz: %1$s<br>Verfällt am: %2$s<br>Aktivierungen übrig: %3$s<br>API URL: %4$s<br>Lizensierte Domain: %5$s<br>Produktname: %6$s

source: Unable to check license.
de: Lizenz konnte nicht geprüft werden.

source: Network Settings
de: Netzwerkeinstellungen

source: license key
de: Lizenzschlüssel

source: There is a new version of %1$s available. %2$sView version %3$s details%4$s.
de: Es gibt eine neue Version von %1$s. %2$sDetails zu Version %3$s ansehen%4$s.
