Repository: sizhit316/twint
Catalog: localization/mametwint-*_informal.po
Languages: de

source: There is a new version of %1$s available. %2$sView version %3$s details%4$s or %5$supdate now%6$s.
de: Es gibt eine neue Version von %1$s. %2$sDetails zu Version %3$s ansehen%4$s oder %5$sjetzt aktualisieren%6$s.

source: You do not have permission to install plugin updates
de: Fehlende Berechtigung, um Plugin-Updates zu installieren

source: Error
de: Fehler

source: TWINT payment successful.
de: TWINT-Zahlung erfolgreich.

source: TWINT payment was successful but only partial amount was approved
de: Die TWINT-Zahlung war erfolgreich, jedoch wurde nur ein Teilbetrag bestätigt

source: The TWINT payment for order %1$s was successful but only a partial amount was approved. The WooCommerce order was not successful.
de: Die TWINT-Zahlung für die Bestellung %1$s war erfolgreich, jedoch konnte nur ein Teilbetrag gebucht werden. Die WooCommerce-Bestellung war nicht erfolgreich.

source: Payment failed because it was only partially approved. Please contact the shop administrator.
de: Die Zahlung ist fehlgeschlagen weil nur ein Teilbetrag bestätigt werden konnte. Bitte kontaktiere den Shop-Administrator.

source: Payment not successful. Please try again or choose a different payment method.
de: Zahlung fehlgeschlagen. Bitte versuche es erneut oder wähle eine andere Zahlungsart.

source: Error in transaction. Please contact the shop administrator.
de: Fehler in der Transaktion. Bitte kontaktiere den Shop-Administrator.

source: Error in transaction. Please try again later or choose a different payment method.
de: Fehler in der Transaktion. Bitte versuche es erneut oder wähle eine andere Zahlungsart.

source: TWINT payment failed.
de: TWINT-Zahlung fehlgeschlagen.

source: TWINT cashier register enrolment failed
de: Registrierung der TWINT-Kasse fehlgeschlagen

source: Cashier register could not be enrolled for website %1$s.
de: Die TWINT-Kasse konnte nicht für die Website %1$s registriert werden.

source: Error message :
de: Fehler-Nachricht:

source: TWINT system check failed
de: TWINT System-Check fehlgeschlagen

source: System check for website %1$s failed.
de: Der System-Check für die Website %1$s ist fehlgeschlagen.

source: Response :
de: Antwort:

source: TWINT failed on the checkout
de: TWINT ist fehlgeschlagen an der Kasse

source: Failed to connect to TWINT on the checkout.
de: Verbindung zu TWINT an der Kasse fehlgeschlagen.

source: TWINT certificate renewal failed
de: Erneuerung des TWINT-Zertifikats fehlgeschlagen

source: The automatic renewal of the TWINT certificate failed for the website %1$s.
de: Die automatische Erneuerung des TWINT-Zertifikats für die Website %1$s ist fehlgeschlagen.

source: Please try manually renewing the certificate from either the TWINT settings in the WordPress backend or from the TWINT portal. Please make sure that all other websites/shops using the same TWINT account are updated accordingly.
de: Bitte erneuere das Zertifikat entweder manuell in den TWINT-Einstellungen im WordPress-Backend oder im TWINT-Portal. Bitte stelle sicher dass alle verbundenen Websites/Shops dasselbe neue Zertifikat verwenden.

source: The old certificates expires %1$s
de: Das bisherige Zertifikat verfällt am %1$s

source: TWINT certificate expired
de: Die Gültigkeit des TWINT-Zertifikats ist verfallen

source: The TWINT certificate for the website %1$s expired. Please renew the certificate from the TWINT settings in the WordPress backend or from the TWINT portal.
de: Die Gültigkeit des TWINT-Zertifikats für die Website %1$s ist verfallen. Bitte erneuere das Zertifikat in den TWINT-Einstellungen im WordPress-Backend oder im TWINT-Portal.

source: TWINT certificate will expire soon.
de: Das TWINT-Zertifikat verfällt bald.

source: The TWINT certificate for the website %1$s will expire in %2$s days. Please renew the certificate from the TWINT settings in the WordPress backend or from the TWINT portal.
de: Das TWINT-Zertifikat für die Website %1$s wird in %2$s verfallen. Bitte erneuere das Zertifikat in den TWINT-Einstellungen im WordPress-Backend oder im TWINT-Portal.

source: TWINT payment was successful but not confirmed
de: TWINT-Zahlung war erfolgreich, wurde jedoch nicht bestätigt

source: The TWINT payment for order %1$s was successful but not confirmed. Please confirm the payment in the order edit screen of the WP backend.
de: Die TWINT-Zahlung für Bestellung %1$s war erfolgreich, wurde jedoch nicht bestätigt. Bitte bestätige die Zahlung im Bestellungs-Bearbeitungsbildschirm im WP-Backend.

source: Please check if the payment gateway works on the WooCommerce checkout page. You can perform a system check in the WooCommerce TWINT settings (enroll cash register). If the system continues to fail for a longer period, please contact our %1$s or the TWINT support (%2$s).
de: Bitte stelle sicher, dass die Zahlungsart TWINT an der Kasse funktioniert. Du kannst in den WooCommerce TWINT-Einstellungen einen Systemcheck vornehmen (Kasse registrieren). Kontaktiere bitte unseren %1$s oder den TWINT-Support (%2$s) falls der Systemcheck für längere Zeit fehlschlägt.

source: Please also check the logs in the WP backend on the page <strong>WooCommerce > Settings > TWINT > Logs</strong>
de: Bitte überprüfe die Logs im WP-Backend auf der Seite <strong>WooCommerce > Einstellungen > TWINT > Logs</strong>

source: Cash register successfully enrolled
de: Kasse erfolgreich registriert

source: SOAP connection to TWINT not set up yet
de: SOAP-Verbindung zu TWINT noch nicht hergestellt

source: Every %d Minutes
de: Alle %d Minuten

source: Back
de: Zurück

source: Next
de: Weiter

source: Close
de: Schliessen

source: License
de: Lizenz

source: TWINT credentials
de: TWINT-Parameter

source: Convert certificate
de: Zertifikat konvertieren

source: 1. Enter license key
de: 1. Lizenzschlüssel eingeben

source: Please enter the plugin license key you received by email. You can always find your license keys in your account at %1$smamedev.ch%2$s.
de: Bitte gib den Lizenzschlüssel ein den du per E-Mail erhalten hast. Du kannst deine Lizenzschlüssel jederzeit in deinem Konto bei %1$smamedev.ch%2$s einsehen.

source: Enter the license key
de: Lizenzschlüssel eingeben

source: 2. Enter TWINT credentials
de: 2. TWINT-Parameter eingeben

source: Enter the information below after you created a new store in the %1$sTWINT%2$s portal.
de: Bitte fülle die Felder unten aus, nachdem du im %1$sTWINT%2$s-Portal einen neuen Store erstellt hast.

source: Enter the store UUID
de: Store UUID eingeben

source: The password for the certificate which was set in the TWINT account when the certificate was created. This is not the password for the TWINT account. Please only use the following special characters in your password: ~!@#%^*_+-={}[]:,./<br>If you forgot the password for your certificate or if you used any special character which is not allowed, you can contact TWINT to create a new certificate: <a href="mailto:support@twint.ch">support@twint.ch</a>
de: Das Zertifikat-Passwort welches im TWINT festgelegt wurde, als das Zertifikat erstellt wurde. Dies ist nicht das Password für das TWINT-Konto. Bitte verwende nur die folgenden Sonderzeichen im Passwort: ~!@#%^*_+-={}[]:,./<br>Wenn du das Passwort für dein Zertifikat vergessen oder andere als die erlaubten Sonderzeichen verwendet hast, kannst du TWINT kontaktieren um ein neues Zertifikat zu erstellen: <a href="mailto:support@twint.ch">support@twint.ch</a>

source: Enter the certificate password
de: Zertifikat-Passwort eingeben

source: Enter a cash register ID
de: Gib eine Kassen-ID ein

source: 3. Convert the TWINT certificate
de: 3. TWINT-Zertifikat umwandeln

source: Upload the certificate you downloaded from your TWINT account in p12 format to automatically convert it.<br><br>If automatic conversion fails you will have to manually convert the certificate to PEM format and either rename it twint.txt and use the upload button or directly upload the renamed file twint.pem to the directory wp-content/uploads/mame_twint.<br><br>Read the %1$s documentation %2$s for more information.
de: Lade das Zertifikat, welches du von deinem TWINT-Konto heruntergeladen hast, im p12-Format hoch um es automatisch ins PEM-Format zu konvertieren.<br><br>Falls die automatische Konvertierung fehlschlägt, muss das Zertifikat manuell ins PEM-Format umgewandelt und danach entweder in twint.txt umbenannt und über den Upload-Button hochgeladen oder in twint.pem umbenannt und ins Verzeichnis wp-content/uploads/mame_twint hochgeladen werden.<br><br>Bitte lies die %1$sAnleitung%2$s für weitere Informationen.

source: Certificate file exists. Upload a new certificate if the current certificate has expired.
de: Es existiert eine Zertifikat-Datei. Bitte lade ein neues Zertifikat hoch, falls das alte abgelaufen oder ungültig ist.

source: Use existing certificate file
de: Existierende Zertifikat-Datei verwenden

source: 4. Enroll cash register
de: 4. Kasse anmelden

source: Click the button below to enroll the cash register and complete the setup.<br><br>The (virtual) cash register has to be enrolled once before you can use TWINT on the checkout page. If you change the register ID you will have to enroll the cash register again. If enrolment fails either store UUID or certificate password is not correct or the certificate has not been correctly converted.
de: Klicke auf den Button um die Kasse anzumelden und die Einrichtung abzuschliessen<br><br>Die (virtuelle) Kasse muss registriert werden, bevor TWINT an der Kasse verwendet werden kann. Wenn du die Kassen-ID änderst, muss die Kasse erneut registriert werden. Falls die Registrierung fehlschlägt, stimmen möglicherweise Store-UUID oder Passwort nicht oder das Zertifikat wurde nicht korrekt umgewandelt.

source: Setup complete
de: Einrichtung abgeschlossen

source: The setup for the TWINT plugin is complete. You can now activate the payment method on the checkout and make a test payment.
de: Die Einrichtung für das TWINT-Plugin wurde erfolgreich abgeschlossen. Du kannst die Zahlungsart nun an der Kasse aktivieren und eine Testzahlung machen.

source: Enable gateway
de: Zahlungsart aktivieren

source: Enable TWINT on the checkout
de: TWINT an der Kasse aktivieren

source: Cancel setup
de: Einrichtung abbrechen
